{
  "english": {
    "enzymes": "If the enzyme is microbial or plant-based, it is considered halal. If it is animal-based, like rennet, it is only halal provided that the animal itself is halal and the way it was slaughtered is halal.",
    "whey": "Rennet, the enzyme used to make whey, can come from an animal which is either not halal or was not slaughtered in a halal way.",
    "lard": "Lard is a fat derived from pigs, which are haram.",
    "meat": "If the meat comes from an animal which is not halal or which was not slaughtered in a halal way, then it is considered haram to consume that meat.",
    "bacon": "Bacon is made from pork, which is haram.",
    "pepperoni": "Pepperoni is almost always made out of pork, which is haram. If it is made from beef, then it is only halal provided that the way the cow was slaughtered is halal.",
    "pork": "Pork is haram.",
    "ham": "Ham is made from pork, which is haram.",
    "chicken": "If the chicken was not slaughtered in a halal way, then it is considered haram to consume its meat.",
    "beef": "If the cow was not slaughtered in a halal way, then it is considered haram to consume its meat.",
    "lamb": "If the lamb was not slaughtered in a halal way, then it is considered haram to consume its meat.",
    "goat": "If the goat was not slaughtered in a halal way, then it is considered haram to consume its meat.",
    "gelatin": "If this protein comes from an animal which is not halal or which was not slaughtered in a halal way, then it is considered haram.",
    "rennet": "If this enzyme is derived from an animal which is either not halal or was not slaughtered in a halal way, then it is considered haram.",
    "l-cysteine": "If this amino acid is sourced from fish, microbial, or plant-based materials, it is considered halal. If it is animal-based, it is only halal provided that the animal itself is halal and the way it was slaughtered is halal.",
    "pepsin": "If this enzyme is derived from an animal which is either not halal or was not slaughtered in a halal way, then it is considered haram.",
    "alcohol": "Alcohol is haram.",
    "beer": "Beer is an alcoholic drink which makes it haram.",
    "ethanol": "Ethanol is an intoxicant, which makes it haram.",
    "vanilla extract": "Since vanilla extract contains alcohol, it is considered haram.",
    "wine vinegar": "Wine vinegar is made by fermenting wine, which is haram.",
    "malt extract": "Due to its alcohol association and use of enzymes which might come from non-halal sources, it is mostly considered haram.",
    "monoglycerides": "If this emulsifier is derived from an animal which is either not halal or was not slaughtered in a halal way, then it is considered haram.",
    "diglycerides": "If this emulsifier is derived from an animal which is either not halal or was not slaughtered in a halal way, then it is considered haram.",
    "e471": "If the E471 (i.e., monoglyceride/diglyceride) emulsifier is derived from an animal which is either not halal or was not slaughtered in a halal way, then it is considered haram.",
    "glycerin": "If this syrupy liquid is derived from an animal which is either not halal or was not slaughtered in a halal way, then it is considered haram.",
    "glycerol": "If this syrupy liquid is derived from an animal which is either not halal or was not slaughtered in a halal way, then it is considered haram.",
    "e422": "If this syrupy liquid (i.e., glycerol) is derived from an animal which is either not halal or was not slaughtered in a halal way, then it is considered haram.",
    "shortening": "If this fat is derived from an animal which is either not halal or was not slaughtered in a halal way, then it is considered haram.",
    "magensium stearate": "If the stearic acid is derived from an animal which is either not halal or was not slaughtered in a halal way, then it is considered haram.",
    "carmine": "Carmine is a red pigment extracted from cochineal insect, which is considered impure or filthy, and therefore haram.",
    "e120": "E120 (i.e., carmine) is a red pigment extracted from cochineal insect, which is considered impure or filthy, and therefore haram."
  },
  "bengali": {
    "এনজাইম": "যদি এনজাইমটি মাইক্রোবায়াল বা উদ্ভিদ-ভিত্তিক হয় তবে এটি হালাল হিসাবে বিবেচিত হয়। যদি এটি রেনেটের মতো প্রাণী-ভিত্তিক হয় তবে এটি কেবল হালাল দেওয়া হয় যে প্রাণীটি নিজেই হালাল এবং এটি যেভাবে জবাই করা হয়েছিল তা হালাল।",
    "হুই": "রেনেট, এনজাইমটি হুই তৈরি করতে ব্যবহৃত, এমন একটি প্রাণী থেকে আসতে পারে যা হালাল নয় বা হালাল উপায়ে জবাই করা হয়নি।",
    "লার্ড": "লার্ড হ'ল শূকর থেকে উদ্ভূত একটি চর্বি, যা হারাম।",
    "মাংস": "যদি মাংসটি এমন কোনও প্রাণী থেকে আসে যা হালাল নয় বা যা হালাল উপায়ে জবাই করা হয়নি, তবে সেই মাংস গ্রহণ করা হারাম হিসাবে বিবেচিত হয়।",
    "বেকন": "বেকন শুয়োরের মাংস থেকে তৈরি, যা হারাম।",
    "পেপারনি": "পেপারোনি প্রায় সবসময় শুয়োরের মাংস দিয়ে তৈরি হয়, যা হারাম। যদি এটি গরুর মাংস থেকে তৈরি করা হয়, তবে কেবল হালাল সরবরাহ করা হয়েছে যে গরুটিকে যেভাবে জবাই করা হয়েছিল তা হালাল।",
    "শুয়োরের মাংস": "শুয়োরের মাংস হারাম।",
    "হ্যাম": "হ্যাম শুয়োরের মাংস থেকে তৈরি, যা হারাম।",
    "মুরগী": "যদি মুরগিকে হালাল উপায়ে জবাই না করা হয়, তবে এর মাংস গ্রহণ করা হারাম হিসাবে বিবেচিত হয়।",
    "গরুর মাংস": "যদি গরুটিকে হালাল উপায়ে জবাই না করা হয়, তবে এর মাংস গ্রহণ করা হারাম হিসাবে বিবেচিত হয়।",
    "মেষশাবক": "যদি মেষশাবকটি হালাল উপায়ে জবাই না করা হয়, তবে এর মাংস গ্রহণ করা হারাম হিসাবে বিবেচিত হয়।",
    "ছাগল": "ছাগলটি যদি হালাল উপায়ে জবাই না করা হয় তবে তার মাংস গ্রহণ করা হারাম হিসাবে বিবেচিত হয়।",
    "জেলটিন": "যদি এই প্রোটিনটি এমন কোনও প্রাণী থেকে আসে যা হালাল নয় বা যা হালাল উপায়ে জবাই করা হয়নি, তবে এটি হারাম হিসাবে বিবেচিত হয়।",
    "রেস": "যদি এই এনজাইমটি এমন কোনও প্রাণী থেকে উদ্ভূত হয় যা হালাল নয় বা হালাল উপায়ে জবাই করা হয় না, তবে এটি হারাম হিসাবে বিবেচিত হয়।",
    "এল-সিস্টাইন": "যদি এই অ্যামিনো অ্যাসিডটি মাছ, মাইক্রোবায়াল বা উদ্ভিদ-ভিত্তিক উপকরণ থেকে উত্সাহিত হয় তবে এটি হালাল হিসাবে বিবেচিত হয়। যদি এটি প্রাণী-ভিত্তিক হয় তবে এটি কেবল হালাল সরবরাহ করা হয় যে প্রাণীটি নিজেই হালাল এবং এটি যেভাবে জবাই করা হয়েছিল তা হালাল।",
    "পেপসিন": "যদি এই এনজাইমটি এমন কোনও প্রাণী থেকে উদ্ভূত হয় যা হালাল নয় বা হালাল উপায়ে জবাই করা হয় না, তবে এটি হারাম হিসাবে বিবেচিত হয়।",
    "অ্যালকোহল": "অ্যালকোহল হারাম।",
    "বিয়ার": "বিয়ার একটি অ্যালকোহলযুক্ত পানীয় যা এটি হারাম করে তোলে।",
    "ইথানল": "ইথানল একটি মাদক, যা এটিকে হারাম করে তোলে।",
    "ভ্যানিলা নিষ্কাশন": "যেহেতু ভ্যানিলা এক্সট্রাক্টে অ্যালকোহল রয়েছে, তাই এটি হারাম হিসাবে বিবেচিত হয়।",
    "ওয়াইন ভিনেগার": "ওয়াইন ভিনেগার ওয়াইন ফারমেন্ট দ্বারা তৈরি করা হয়, যা হারাম।",
    "মাল্ট এক্সট্রাক্ট": "এর অ্যালকোহল অ্যাসোসিয়েশন এবং এনজাইমগুলির ব্যবহারের কারণে যা অ-হালাল উত্স থেকে আসতে পারে, এটি বেশিরভাগ ক্ষেত্রে হারাম হিসাবে বিবেচিত হয়।",
    "মনোগ্লিসারাইডস": "যদি এই ইমালসিফায়ারটি এমন কোনও প্রাণী থেকে উদ্ভূত হয় যা হালাল নয় বা হালাল উপায়ে জবাই করা হয় না, তবে এটি হারাম হিসাবে বিবেচিত হয়।",
    "ডিগ্লিসারাইডস": "যদি এই ইমালসিফায়ারটি এমন কোনও প্রাণী থেকে উদ্ভূত হয় যা হালাল নয় বা হালাল উপায়ে জবাই করা হয় না, তবে এটি হারাম হিসাবে বিবেচিত হয়।",
    "e471": "যদি E471 (অর্থাত্, মনোগ্লিসারাইড/ডিগ্লিসারাইড) ইমুলিফায়ার এমন একটি প্রাণী থেকে উদ্ভূত হয় যা হয় হালাল নয় বা হালাল উপায়ে জবাই করা হয় না, তবে এটি হারাম হিসাবে বিবেচিত হয়।",
    "গ্লিসারিন": "যদি এই সিরাপি তরলটি এমন একটি প্রাণী থেকে উদ্ভূত হয় যা হালাল নয় বা হালাল উপায়ে জবাই করা হয় না, তবে এটি হারাম হিসাবে বিবেচিত হয়।",
    "গ্লিসারল": "যদি এই সিরাপি তরলটি এমন একটি প্রাণী থেকে উদ্ভূত হয় যা হালাল নয় বা হালাল উপায়ে জবাই করা হয় না, তবে এটি হারাম হিসাবে বিবেচিত হয়।",
    "e422": "যদি এই সিরাপি তরল (অর্থাত্ গ্লিসারল) এমন একটি প্রাণী থেকে উদ্ভূত হয় যা হয় হালাল নয় বা হালাল উপায়ে জবাই করা হয় না, তবে এটি হারাম হিসাবে বিবেচিত হয়।",
    "সংক্ষিপ্তকরণ": "যদি এই চর্বি এমন কোনও প্রাণী থেকে উদ্ভূত হয় যা হালাল নয় বা হালাল উপায়ে জবাই করা হয় না, তবে এটি হারাম হিসাবে বিবেচিত হয়।",
    "ম্যাগেনসিয়াম স্টিয়ারেট": "যদি স্টিয়ারিক অ্যাসিডটি এমন কোনও প্রাণী থেকে উদ্ভূত হয় যা হালাল নয় বা হালাল উপায়ে জবাই করা হয় না, তবে এটি হারাম হিসাবে বিবেচিত হয়।",
    "কারমিন": "কারমাইন হ'ল একটি লাল রঙ্গক যা কোচিনিয়াল পোকামাকড় থেকে নিষ্কাশিত হয়, যা অপরিষ্কার বা নোংরা হিসাবে বিবেচিত হয় এবং তাই হারাম।",
    "e120": "E120 (অর্থাত্, কারমাইন) কোচিনিয়াল পোকামাকড় থেকে নেওয়া একটি লাল রঙ্গক, যা অপরিষ্কার বা নোংরা হিসাবে বিবেচিত হয় এবং তাই হারাম।"
  },
  "arabic": {
    "الإنزيمات": "إذا كان الإنزيم الميكروبي أو النبات ، فإنه يعتبر حلالًا. إذا كان قائمًا على الحيوانات ، مثل Rennet ، فمن الشكر فقط أن يكون الحيوان نفسه حلالًا والطريقة التي تم ذبحها هي حلال.",
    "مصل اللبن": "Rennet ، الإنزيم المستخدم لصنع مصل اللبن ، يمكن أن يأتي من حيوان ليس حلالا أو لم يتم ذبحه بطريقة حلال.",
    "شحم الخنزير": "شحم الخنزير مشتق من الخنازير ، وهي حرام.",
    "لحمة": "إذا جاء اللحم من حيوان ليس حلالًا أو لم يتم ذبحه بطريقة حلال ، فسيعتبر حرام أن تستهلك تلك اللحوم.",
    "لحم خنزير مقدد": "لحم الخنزير المقدد مصنوع من لحم الخنزير ، وهو حرام.",
    "بيبروني": "Pepperoni يصنع دائمًا من لحم الخنزير ، وهو حرام. إذا كان مصنوعًا من لحوم البقر ، فهذا الحلال فقط شريطة أن تكون الطريقة التي تم بها ذبح البقرة حلالًا.",
    "لحم خنزير": "لحم الخنزير حرام.",
    "لحم خنزير": "لحم الخنزير مصنوع من لحم الخنزير ، وهو حرام.",
    "فرخة": "إذا لم يتم ذبح الدجاج بطريقة حلال ، فإنه يعتبر حرام يستهلك لحمه.",
    "لحم": "إذا لم يتم ذبح البقرة بطريقة حلال ، فإنها تعتبر حرام أن تستهلك لحمها.",
    "حمَل": "لم يتم ذبح الخروف بطريقة حلال ، فإنه يعتبر حرام أن يستهلك لحمه.",
    "معزة": "إذا لم يتم ذبح الماعز بطريقة حلال ، فإنه يعتبر حرام يستهلك لحمه.",
    "الجيلاتين": "إذا جاء هذا البروتين من حيوان ليس حلالًا أو لم يتم ذبحه بطريقة حلال ، فإنه يعتبر حرام.",
    "سباق": "إذا كان هذا الإنزيم مشتقًا من حيوان ليس حلالًا أو لم يتم ذبحه بطريقة حلال ، فإنه يعتبر حرام.",
    "L-cystine": "إذا تم الحصول على هذا الأحماض الأمينية من الأسماك أو الميكروبات أو المواد النباتية ، فإنه يعتبر حلالًا. إذا كان قائمًا على الحيوانات ، فهذا الحلال فقط شريطة أن يكون الحيوان نفسه حلالًا والطريقة التي تم ذبحها هي حلال.",
    "بيبسين": "إذا كان هذا الإنزيم مشتقًا من حيوان ليس حلالًا أو لم يتم ذبحه بطريقة حلال ، فإنه يعتبر حرام.",
    "الكحول": "الكحول حرام.",
    "جعة": "البيرة مشروب كحولي يجعله حرام.",
    "الإيثانول": "الإيثانول هو مسكر ، مما يجعله حرام.",
    "مستخلص الفانيليا": "منذ أن يحتوي مستخلص الفانيليا على الكحول ، يعتبر حرام.",
    "خل النبيذ": "خل النبيذ مصنوع عن طريق تخمير النبيذ ، وهو حرام.",
    "استخراج الشعير": "بسبب ارتباط الكحول واستخدام الإنزيمات التي قد تأتي من مصادر غير نصف ، فإنها تعتبر في الغالب حرام.",
    "Monoglycerides": "إذا كان هذا المستحلب مشتقًا من حيوان ليس حلالًا أو لم يتم ذبحه بطريقة حلال ، فإنه يعتبر حرام.",
    "Diglycerides": "إذا كان هذا المستحلب مشتقًا من حيوان ليس حلالًا أو لم يتم ذبحه بطريقة حلال ، فإنه يعتبر حرام.",
    "e471": "إذا كان مستحلب E471 (على سبيل المثال ، monoglyceride/diglyceride) مشتقًا من حيوان ليس حلالًا أو لم يتم ذبحه بطريقة حلال ، فإنه يعتبر حرامًا.",
    "الجليسرين": "إذا تم اشتقاق هذا السائل الشراب من حيوان ليس حلالًا أو لم يتم ذبحه بطريقة حلال ، فإنه يعتبر حرام.",
    "الجلسرين": "إذا تم اشتقاق هذا السائل الشراب من حيوان ليس حلالًا أو لم يتم ذبحه بطريقة حلال ، فإنه يعتبر حرام.",
    "e422": "إذا كان هذا السائل الشراب (أي الجلسرين) مشتقًا من حيوان ليس حلالًا أو لم يتم ذبحه بطريقة الحلال ، فإنه يعتبر حرامًا.",
    "تقصير": "إذا كانت هذه الدهون مشتقة من حيوان ليس حلالًا أو لم يتم ذبحه بطريقة حلال ، فإنه يعتبر حرام.",
    "Magensium Stearate": "إذا تم اشتقاق حمض ستيريك من حيوان ليس حلالًا أو لم يتم ذبحه بطريقة حلال ، فإنه يعتبر حرام.",
    "كارمين": "كارمين عبارة عن صبغة حمراء مستخرجة من الحشرات القوية ، والتي تعتبر نجسًا أو قذرة ، وبالتالي حرام.",
    "e120": "E120 (على سبيل المثال ، كارمين) عبارة عن صبغة حمراء مستخرجة من حشرة كوكينية ، والتي تعتبر نجسًا أو قذرة ، وبالتالي حرام."
  }
}
